from select import select


print("ある日、前日にオールをした私は睡魔に襲われ、最終時限についに寝てしまった。ここで問題が起こる・・・")
print("閉校時間になっても寝てて閉じ込められてしまったのだ!　しかし教室内を見渡すと同じような仲間を発見した!")
name=input("あなたの名前は？")
print("とりあえず脱出しないと!　どうしようか、と周りを見渡した"
    "すると道用先生のパソコンを見つけた!　パスワードが設定されている!　これを開くと扉が開くらしいぞ!"
    "しかしあと2回間違えるとパソコンがロックされてしまい、制限されてしまうらしい!")
   
selecta=int(input("制限かかる前にどれを選ぶ？1~3の中から選べ!"))
if selecta==1:
    print("doyo.free")
    print("道用先生は独身ではなく既婚者らしい")
elif selecta==3:
    print("doyo.tokyo")
    print("道用先生は富山県出身らしい")
elif selecta==2:
    print("doyo.46")
    print("開けた!　46歳らしいな。毎年パスワードの数値変えてるのかなぁ？")

    
print("扉が開いた!外に出よう!あれ？1階で火事が起きてる!出口は1階なのに!")
selectb=int(input("どうする？1,2の二択から選べ"))
if selectb ==1:
    print("下に行く")
    print("火事に巻き込まれて死。")
elif selectb==2:
    print("火事に巻き込まれないように上へ行く")
    print("とりあえず火事から逃れることには成功した")

print("上に上がることはできたが、スマホの充電が0%で連絡手段が無い!仲間の一人は3%しか残ってない!"
       "残り3%しか残ってない仲間のスマホを使ってどこに連絡をすれば助かるのか？")
selectc=int(input("どこに連絡をかける？1,2の二択から選べ"))
if selectc==1:
    print("消防署に掛ける")
    print("しかし消火作業を優先的に行い助けようとした消防署は火の増す勢いに立ち向かえず、救助が間に合わず、死。")
elif selectc==2:
    print("大富豪の友達に掛ける")
    print("プライベートジェット機をすぐに飛ばしてくれて、大学の屋上に停め、救助に成功!無事脱出可能となる。"
          "Fin ")
